rikkapro0128/system_node_esp32_iot/src/main.cpp
// => DEBUG FUNC

#ifdef _DEBUG_
void viewEEPROM();
#endif

// => FUNC WEBSEVER SERVER
void checkLinkAppication(AsyncWebServerRequest *request);
void linkAppication(AsyncWebServerRequest *request, JsonVariant &json);
void addConfiguration(AsyncWebServerRequest *request, JsonVariant &json);
void resetConfigurationWifi(AsyncWebServerRequest *request);
void resetConfigurationFirebase(AsyncWebServerRequest *request);
void checkConfiguration(AsyncWebServerRequest *request);
void notFound(AsyncWebServerRequest *request);
void restartEsp(AsyncWebServerRequest *request);

// => FUNC EXECUTE GENERAL
void checkRam();
float_t ramHeapSize();
void setupStreamFirebase();
void checkFirebaseInit();
void setupWifiModeStation();
void setupWebserverModeAP();
void clearBufferFirebaseDataAll();
unsigned long Get_Epoch_Time();
void streamCallback(FirebaseStream data);
void streamTimeoutCallback(bool timeout);
unsigned int strLength(const char *str);

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE NODE TYPE -> LOGIC *********************************************************************************************************************************************************************************************************************************
 */

#ifdef LOGIC
#ifdef _DEBUG_
void PrintListTimer();
#endif
void parserTimerJson(FirebaseStream &data, uint8_t numberDevice, bool isInit = true);
void parserDeviceStatus(FirebaseStream &data, uint8_t numberDevice);
void controllDevice(uint8_t numDevice, bool state, bool syncFirebase = false, bool ignore = false);
void readTimer(FirebaseJson &fbJson, uint8_t numberDevice, String keyAdd = "");
void removeTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE], String key, bool isCallBack = false);
void sortTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE]);
#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE NODE TYPE -> COLOR *********************************************************************************************************************************************************************************************************************************
 */

// define here....
#ifdef COLOR

void setColorChainRGBA(uint32_t c, uint8_t a);

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* EEPROM *********************************************************************************************************************************************************************************************************************************
 */
EepromMiru eeprom(300, "esp8266-device-db-default-rtdb.firebaseio.com");

/**
 * ********* SERVER *********************************************************************************************************************************************************************************************************************************
 */
AsyncWebServer server(80);

/**
 * ********* FIREBASE *******************************************************************************************************************************************************************************************************************************
 */
FirebaseData fbdoStream;
FirebaseData fbdoControl;
FirebaseData createNode;

FirebaseAuth auth;
FirebaseConfig config;

/**
 * ********* WIFI MODE - STATION ********************************************************************************************************************************************************************************************************************
 */

String mode_ap_ssid = "esp32-";
String mode_ap_pass = "44448888";

uint32_t Wheel(byte WheelPos)
{
  WheelPos = 255 - WheelPos;
  if (WheelPos < 85)
  {
    return strip.Color(255 - WheelPos * 3, 0, WheelPos * 3);
  }
  if (WheelPos < 170)
  {
    WheelPos -= 85;
    return strip.Color(0, WheelPos * 3, 255 - WheelPos * 3);
  }
  WheelPos -= 170;
  return strip.Color(WheelPos * 3, 255 - WheelPos * 3, 0);
}

void setup()
{
  GEN_ID_BY_MAC.replace(":", "");
  ID_DEVICE = String("device-" + GEN_ID_BY_MAC);

#ifdef _DEBUG_
  Serial.begin(115200);
#endif
#ifdef _RELEASE_
  Serial.begin(115200);
#endif

#ifdef COLOR
  strip.begin();
  strip.setBrightness(100);
  strip.show();
#endif

#ifdef _DEBUG_
  Serial.println("");
  Serial.println("[---PROGRAM START---]");
#endif

  configTime(0, 0, ntpServer);
  eeprom.begin();

#ifdef _DEBUG_
  viewEEPROM();
  Serial.printf("[DEBUG] Data Color = rgba(%d, %d, %d, %d)\n", color[0], color[1], color[2], color[3]);
  Serial.println("[DEBUG] Mode Color = " + String(modeRGB));
#endif

  WiFi.hostname(CHost);
  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(true);
  WiFi.softAP(String(mode_ap_ssid + GEN_ID_BY_MAC).c_str(), mode_ap_pass.c_str());

#ifdef _DEBUG_
  IPAddress IP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
#endif

  setupWifiModeStation();

  while (WiFi.status() != WL_CONNECTED)
  {
    if (timeoutWifi > 12)
    {
      WiFi.disconnect(true);
      break;
    }
    timeoutWifi++;
    delay(500);
  }

  setupWebserverModeAP();

  config.database_url = eeprom.databaseUrl;
  config.signer.test_mode = true;
#ifdef ESP8266
  fbdoStream.setBSSLBufferSize(1024 /* Rx in bytes, 512 - 16384 */, 1024 /* Tx in bytes, 512 - 16384 */);
#endif
  Firebase.begin(&config, &auth);
  Firebase.reconnectWiFi(true);
  checkFirebaseInit();
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

void loop()
{
#ifdef LOGIC
#ifdef _RELEASE_
  if (Serial.available() > 0)
  {
    uartPicControl = (int)Serial.parseInt();
    if (uartPicControl > 0 && blockControl == false)
    {
      control = uartPicControl % 2 == 0 ? false : true;
      if (uartPicControl < 3)
      {
        idControl = 1;
      }
      else if (uartPicControl < 5)
      {
        idControl = 2;
      }
      else if (uartPicControl < 7)
      {
        idControl = 3;
      }
      if (millis() - timeDebounceLocalControl > 1000)
      {
        timeDebounceLocalControl = millis();
        if (WiFi.status() == WL_CONNECTED)
        {
          controllDevice(idControl, control, true, true);
        }
        else
        {
          controllDevice(idControl, control, false, true);
        }
      }
    }
  }
#endif
  if ((millis() - sendDataPrevMillis > 2500 || sendDataPrevMillis == 0))
  {
    sendDataPrevMillis = millis();
    if (timerStack[0][1] != NULL && timeControll)
    {
#ifdef _DEBUG_
      PrintListTimer();
#endif
      epochTime = Get_Epoch_Time();
#ifdef _DEBUG_
      Serial.println("TimeStamp = " + String(epochTime));
#endif
      bool expire = timerStack[0][1] > epochTime && timerStack[0][1] != NULL ? false : true;
      if (expire)
      {
        unsigned long rangeTimer = epochTime - timerStack[0][1];
        if (rangeTimer < 4)
        {
#ifdef _RELEASE_
          bool state = timerStack[0][2] == 1 ? true : timerStack[0][2] == 2           ? false
                                                  : stateDevice[timerStack[0][0] - 1] ? false
                                                                                      : true;
          controllDevice(timerStack[0][0], state, true);
#endif
        }
#ifdef _DEBUG_
        Serial.printf("Controll timer = %d\n", timerStack[0][1]);
        Serial.printf("[Epoch Time] = %d", rangeTimer);
#endif
        removeTimer(timerStack, indexTimerStack, indexTimerStack[0]);
      }
    }
  }
#endif

#ifdef COLOR
  // execute something...
  if (acceptChange)
  {
    if (modeRGB == SINGLE)
    {
      #ifdef _DEBUG_
  Serial.printf("[DEBUG] Data Color = rgba(%d, %d, %d, %d)\n", color[0], color[1], color[2], color[3]);
#endif
      setColorChainRGBA(strip.Color(color[0], color[1], color[2]), color[3]);
    }
    else if (modeRGB == RAINBOW)
    {
      uint16_t i, j;

      for (j = 0; j < 256 * 5; j++)
      { // 5 cycles of all colors on wheel
        for (i = 0; i < strip.numPixels(); i++)
        {
          strip.setPixelColor(i, Wheel(((i * 256 / strip.numPixels()) + j) & 255));
        }
        strip.show();
        delay(20);
      }
    }
    acceptChange = false;
  }
#endif

#ifdef _DEBUG_
  if (millis() - timeIntervalCheckRamSize > 2500)
  {
    timeIntervalCheckRamSize = millis();
    checkRam();
  }
#endif
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* START DEFINE FUNCTION REQUEST *********]
 *
 */

