rikkapro0128/system_node_esp32_iot/src/main.cpp
void restartEsp(AsyncWebServerRequest *request)
{
  ESP.restart();
  request->send(200, "application/json", "{\"message\":\"ESP RESTARTED\"}");
}

void notFound(AsyncWebServerRequest *request)
{
  request->send(404, "text/plain", "Not found");
}

// [POST]
void linkAppication(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    if (eeprom.canAccess)
    {
#ifdef _DEBUG_
      Serial.println("DB Node = " + eeprom.DATABASE_NODE);
      Serial.println("Wifi Status = " + String(WiFi.status()));
#endif
      JsonObject body = json.as<JsonObject>();
      String idUser = body["idUser"];
      String idNode = body["idNode"];
#ifdef _DEBUG_
      Serial.println("Link App: idUser = " + idUser + " - idNode = " + idNode);
#endif
      if (idUser.length() > 0 && idNode.length() > 0)
      {
        bool stateSaveNodeId = eeprom.saveNodeID(idNode);
        bool stateSaveUserId = eeprom.saveUserID(idUser);
        if (stateSaveNodeId && stateSaveUserId)
        {
          clearBufferFirebaseDataAll();
#ifdef _DEBUG_
          Serial.println("--- Start Init New Firebase Stream ---");
#endif
          checkFirebaseInit();
          createNode.clear();
          if (fbdoStream.isStream())
          {
            request->send(200, "application/json", "{\"message\":\"LINK APP HAS BEEN SUCCESSFULLY\"}");
          }
          else
          {
            request->send(400, "application/json", "{\"message\":\"LINK APP HAS BEEN FAIL\"}");
          }
        }
        else
        {
          request->send(500, "application/json", "{\"message\":\"FAILURE SAVE PAYLOADS\"}");
        }
      }
      else
      {
        if (idUser.length() <= 0)
        {
          request->send(400, "application/json", "{\"message\":\"ID USER IS NULL\"}");
        }
        else if (idNode.length() <= 0)
        {
          request->send(400, "application/json", "{\"message\":\"ID NODE IS NULL\"}");
        }
        else
        {
          request->send(400, "application/json", "{\"message\":\"PAYLOAD INVALID\"}");
        }
      }
    }
    else
    {
      request->send(500, "application/json", "{\"message\":\"SOMETHING WENT WRONG\"}");
    }
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

// [POST]
void addConfiguration(AsyncWebServerRequest *request, JsonVariant &json)
{
  if (!json.isNull())
  {
    JsonObject body = json.as<JsonObject>();

    String ssid = body["ssid"];
    String password = body["password"];
    eeprom.saveSSID(ssid);
    eeprom.savePassword(password);
    // Serial.println("[Save config EEPROM]");
    request->send(200, "application/json", "{\"message\":\"CONFIGURATION WIFI SUCCESSFULLY\"}");
    setupWifiModeStation();
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"NOT FOUND PAYLOAD\"}");
  }
}

// [POST]
void resetConfigurationWifi(AsyncWebServerRequest *request)
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("reset config: wifi = " + ssid + " - password = " + password);
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    eeprom.saveSSID("");
    eeprom.savePassword("");
  }
  request->send(200, "application/json", "{\"message\":\"RESET CONFIG SUCCESSFULLY\"}");
}

void resetConfigurationFirebase(AsyncWebServerRequest *request)
{
  String response_str;
  DynamicJsonDocument response_json(200);
  size_t index = 0;

  if (eeprom.saveNodeID(""))
  {
    response_json["list-reset"][index] = "nodeId";
    index++;
  }
  if (eeprom.saveUserID(""))
  {
    response_json["list-reset"][index] = "userId";
    index++;
  }
  eeprom.saveDatabaseUrl("");
  request->send(200, "application/json", "{\"message\":\"RESET CONFIG SUCCESSFULLY\"}");
}

// [GET]
void checkLinkAppication(AsyncWebServerRequest *request)
{
  String nodeID = eeprom.readNodeID();
  String userID = eeprom.readUserID();
#ifdef _DEBUG_
  Serial.println("check link app: nodeID = " + nodeID + " - userID = " + userID);
#endif
  if (nodeID.length() && userID.length())
  {
    String response_str;
    DynamicJsonDocument response_json(200);
    JsonObject payload = response_json.to<JsonObject>();
    payload["nodeID"] = nodeID;
    payload["userID"] = userID;
    payload["message"] = "CONFIG IS FOUND";
    serializeJson(payload, response_str);
    request->send(200, "application/json", response_str);
    response_json.clear();
  }
  else
  {
    request->send(403, "application/json", "{\"message\":\"CONFIG NOT FOUND\"}");
  }
}

// [GET]
void checkConfiguration(AsyncWebServerRequest *request)
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
#ifdef _DEBUG_
  Serial.println("check config: ssid = " + ssid + " - password = " + password);
#endif
  if (ssid.length() > 0 && password.length() > 0)
  {
    String response_str;
    DynamicJsonDocument response_json(200);
    JsonObject payload = response_json.to<JsonObject>();
    payload["ssid"] = ssid;
    payload["password"] = password;
    payload["ip-station"] = WiFi.localIP();
    payload["status-station"] = WiFi.status();
    payload["quality-station"] = WiFi.RSSI();
    payload["message"] = "WIFI HAS BEEN CONFIG";
    serializeJson(payload, response_str);
    request->send(200, "application/json", response_str);
    response_json.clear();
  }
  else
  {
    request->send(200, "application/json", "{\"message\":\"WIFI NOT YET CONFIG\"}");
  }
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION DEBUG *********]
 *
 */

#ifdef _DEBUG_

void checkRam()
{
  Serial.printf("Ram size = %d (bytes)\n", ESP.getFreeHeap());
}

void viewEEPROM()
{
  String ssid = eeprom.readSSID();
  String password = eeprom.readPassword();
  String url = eeprom.readDatabaseUrl();
  String nodeID = eeprom.readNodeID();
  String userID = eeprom.readUserID();
  String dbNode = eeprom.DATABASE_NODE;
  String urlNode = eeprom.readDatabaseUrlNode();

  Serial.println("WIFI NAME = " + ssid + " | length = " + String(ssid.length()));
  Serial.println("WIFI PASS = " + password + " | length = " + String(password.length()));
  Serial.println("WIFI DATATBASE URL = " + url + " | length = " + String(url.length()));
  Serial.println("STATE URL = " + String(eeprom.canAccess));
  Serial.println("WIFI DATATBASE URL - NODE = " + dbNode + " | length = " + String(dbNode.length()));
  Serial.println("WIFI NODE ID = " + nodeID + " | length = " + String(nodeID.length()));
  Serial.println("WIFI USER ID = " + userID + " | length = " + String(userID.length()));
}

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* {START} DEFINE FUNCTION NODE -> TYPE "LOGIC" *********]
 *
 */

#ifdef LOGIC

#ifdef _DEBUG_

void PrintListTimer()
{
  Serial.println("\nTimer Unix Stack: ");
  for (size_t i = 0; i < NUMS_TIMER; i++)
  {
    if (timerStack[i][0] == NULL)
    {
      Serial.print("NULL");
      break;
    }
    if (i == 0)
    {
      Serial.print("[");
    }
    for (size_t j = 0; j < 3; j++)
    {
      /* code */
      if (j == 0)
      {
        Serial.print("[");
      }
      Serial.print(String(timerStack[i][j]));
      if (j == 2)
      {
        Serial.print("]");
      }
      else
      {
        Serial.print(", ");
      }
    }
    if (timerStack[i + 1][0] == NULL && timerStack[i + 1][1] == NULL && timerStack[i + 1][2] == NULL)
    {
      Serial.print("]");
      break;
    }
  }
  Serial.println("\nTimer Name Stack: ");
  for (size_t i = 0; i < NUMS_TIMER; i++)
  {
    if (strcmp(indexTimerStack[i], "") == 0)
    {
      Serial.print("NULL");
      break;
    }
    if (i == 0)
    {
      Serial.print("[");
    }
    Serial.print(String(indexTimerStack[i]) + (i == NUMS_TIMER - 1 ? "" : ", "));
    if (strcmp(indexTimerStack[i + 1], "") == 0)
    {
      Serial.print("]");
      break;
    }
  }
  Serial.println();
}

#endif

void removeTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE], String key, bool isCallBack)
{
  size_t indexFind;
  bool isFind = false;
  unsigned long numDevice;
  for (size_t i = 0; i < NUMS_TIMER; i++)
  {
    if (isFind)
    {
      break;
    }
    if (strcmp(stackName[i], key.c_str()) == 0)
    {
      indexFind = i;
      isFind = true;
      numDevice = stack[i][0];
      for (size_t j = i; j < NUMS_TIMER; j++)
      {
        if (strcmp(stackName[j + 1], "") == 0)
        {
          strcpy(stackName[j], "");
          break;
        }
        strcpy(stackName[j], stackName[j + 1]);
      }
    }
  }
  if (isFind)
  {
    for (size_t i = indexFind; i < NUMS_TIMER; i++)
    {
      if (stack[i + 1][0] == NULL)
      {
        stack[i][0] = NULL;
        stack[i][1] = NULL;
        stack[i][2] = NULL;
        break;
      }
      else
      {
        stack[i][0] = stack[i + 1][0];
        stack[i][1] = stack[i + 1][1];
        stack[i][2] = stack[i + 1][2];
      }
    }
    if (!isCallBack)
    {
      String pathRemove = eeprom.DATABASE_NODE + "/devices/" + ID_DEVICE + "-" + String(numDevice) + "/timer/" + key;
      FirebaseData deleteNode;
      fbdoControl.clear();
      if (ramHeapSize() > (float_t)SSL_HANDSHAKE_REQUIRE)
      {
        if (Firebase.RTDB.deleteNode(&deleteNode, pathRemove))
        {
          if (timerStack[0][1] == NULL)
          {
            timeControll = false;
          }
        }
      }
#ifdef _DEBUG_
      Serial.println("[DELETED PATH] = " + pathRemove);
      Serial.printf("[TIME END] = %d", millis());
#endif
    }
  }
}

void sortTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE])
{
  char tempSortIndex[MAX_NAME_INDEX_FIREBASE] = "";
  unsigned long tempSort;
  for (size_t i = 0; i < NUMS_TIMER; i++)
  {
    if (stack[i][1] == NULL)
    {
      break;
    }
    for (size_t j = i + 1; j < NUMS_TIMER; j++)
    {
      if (stack[j][1] == NULL)
      {
        break;
      }
      if (stack[j][1] < stack[i][1])
      {
        // assign unix
        tempSort = stack[i][1];
        stack[i][1] = stack[j][1];
        stack[j][1] = tempSort;
        // assign index device
        tempSort = stack[i][0];
        stack[i][0] = stack[j][0];
        stack[j][0] = tempSort;
        // assign control device
        tempSort = stack[i][2];
        stack[i][2] = stack[j][2];
        stack[j][2] = tempSort;

        // assign index name firebase
        strcpy(tempSortIndex, stackName[i]);
        strcpy(stackName[i], stackName[j]);
        strcpy(stackName[j], tempSortIndex);
      }
    }
  }
}

void parserDeviceStatus(FirebaseStream &data, uint8_t numberDevice)
{
  String deviceField = "device-" + GEN_ID_BY_MAC + "-" + numberDevice;
  if (data.jsonObject().get(deviceJson, deviceField + "/state"))
  {
    if (deviceJson.typeNum == 7) // check is boolean
    {
      bool state = deviceJson.to<bool>();
      controllDevice(numberDevice, state);
      stateDevice[numberDevice - 1] = state;
      delay(400);
    }
  }
}

